# YOLOv8 + CBAM (Convolutional Block Attention Module) — varian ber-atensi
# Identik YOLOv8 baku, ditambah 3 blok CBAM pada keluaran P3/P4/P5 sebelum Detect.
# Tujuan: isolasi efek mekanisme atensi (channel + spatial) terhadap deteksi helm.

nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]       # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]            # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]            # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]            # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]           # 21 (P5/32-large)

  # --- Blok atensi CBAM pada tiap skala deteksi ---
  # c1 ditulis eksplisit (channel hasil scale 's': P3=128, P4=256, P5=512),
  # karena parse_model tidak menyuntik c1 untuk modul di luar base_modules.
  # CATATAN: YAML ini KHUSUS scale 's'; ganti channel bila pakai scale lain.
  - [15, 1, CBAM, [128, 7]]        # 22 - CBAM pada P3 (128 ch)
  - [18, 1, CBAM, [256, 7]]        # 23 - CBAM pada P4 (256 ch)
  - [21, 1, CBAM, [512, 7]]        # 24 - CBAM pada P5 (512 ch)

  - [[22, 23, 24], 1, Detect, [nc]]  # Detect pada keluaran ber-atensi
